Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooSmallRebarSetForCurrentFormula
Rebar set is too small for the current layout formula.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooLargeNumberOfBars
The number of bars in the set cannot exceed 1002.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureDueToStaggerOffset
Can't solve Rebar Shape using the existing stagger offsets.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarInvalidRunnout
The remainder is less than one bar diameter, which may result in double counting in schedules. Adjust the layout or remove one of the overlapped bars.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHookOverEndTreatment
Cannot add hook to the end that already has an end treatment.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHookOverCrank
Cannot add hook to the end that already has a crank.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarEndTreatmentOverHook
Cannot add end treatment to the end that already has a hook.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarEndTreatmentOverCrank
Cannot add end treatment to the end that already has a crank.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarCrankOverHook
Cannot add crank to the end that already has a hook.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarCrankOverEndTreatment
Cannot add crank to the end that already has an end treatment.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarCrankCannotBeAddedToShape
Cannot add crank to this type of Rebar Shape.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarCannotBeDeleted
You cannot delete all bars for the sets that are being edited.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoElementsToEditConstraints
There is no Rebar to edit constraints.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.FormulaLengthExceedsArrayLengthLimit
Fixed custom spacing formula produces an array length that exceeds the allowed limits.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CrankTypeWasDeleted
Crank type was deleted.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CrankDoesntFitSegment
Curves are too small to fit the Rebar Shape with Crank.